---
kind: method
id: M:Autodesk.Revit.DB.ElementRecord.GetOwnerViewId
source: html/24b1d13e-e45f-5594-1f48-1d3d02191eaf.htm
---
# Autodesk.Revit.DB.ElementRecord.GetOwnerViewId Method

Gets the element id of the owner view record.

## Syntax (C#)
```csharp
public ElementId GetOwnerViewId()
```

## Returns
The view record element id.